text/chart_style/tdd_assert_equal/README.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<!-- 2019-10-07 月 11:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>assert_equal</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shigeto R. Nishitani" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">assert_equal</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf1722f7">1. equal</a></li>
<li><a href="#org660b97e">2. method</a></li>
<li><a href="#org8f5438f">3. red, green</a></li>
<li><a href="#orgff2279b">4. richer output</a></li>
<li><a href="#org16013bd">5. assert_not_equal</a></li>
<li><a href="#org18fe0dd">6. refactoringというほどでもないですが，</a></li>
<li><a href="#org93b30f4">7. 重複実行の予防</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf1722f7" class="outline-2">
<h2 id="orgf1722f7"><span class="section-number-2">1</span> equal</h2>
<div class="outline-text-2" id="text-1">
<p>
テスト駆動開発で今後の学習を進めて行くんですが，
その根本となるassert_equalを作って置きます．
どんなのでもいいんですが，自分で作ると好きにできますんで，
その様子を見てもらいましょう．
assert equalとはequalかどうかを確かめる(assert)関数です．
</p>

<p>
まずは1==1です．
</p>
<div class="org-src-container">
<pre class="src src-ruby">p 1==1
</pre>
</div>
<p>
として見ましょう．
</p>
<pre class="example">
&gt; ruby assert_equal.rb
true
</pre>
<p>
と返ってきてますか？
</p>
</div>
</div>
<div id="outline-container-org660b97e" class="outline-2">
<h2 id="org660b97e"><span class="section-number-2">2</span> method</h2>
<div class="outline-text-2" id="text-2">
<p>
これをmethodにします．英語の感覚だと，
</p>
<pre class="example">
assert equal expected and result

</pre>
<p>
とでもなるでしょうか．なんで，
</p>
<pre class="example">
assert_equal(expected, result)

</pre>
<p>
という感じです．まずはred
</p>
<div class="org-src-container">
<pre class="src src-ruby">p assert_equal(1, 1)
</pre>
</div>
<p>
として見ましょう．
</p>
<pre class="example">
&gt; ruby assert_equal.rb
assert_equal.rb:1:in `&lt;main&gt;': undefined method `assert_equal' for main:Object (NoMethodError)
</pre>
<p>
関数がないと怒られますよね．
それなら，
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">assert_equal</span>(expected, result)
  <span style="font-weight: bold;">return</span> expected == result
<span style="font-weight: bold;">end</span>

p assert_equal(1, 1)
</pre>
</div>
<p>
なら動くし，ちゃんとtrueが返ってますよね．
</p>
</div>
</div>
<div id="outline-container-org8f5438f" class="outline-2">
<h2 id="org8f5438f"><span class="section-number-2">3</span> red, green</h2>
<div class="outline-text-2" id="text-3">
<p>
これだけだと，殺風景なんで，red, green, refactoringという標語に
したがって動作するように変えます．
肝は，colorizeです．
</p>
<div class="org-src-container">
<pre class="src src-ruby">require <span style="font-style: italic;">'colorize'</span>

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">assert_equal</span>(expected, result)
  <span style="font-weight: bold;">if</span> expected == result
    puts <span style="font-style: italic;">'true'</span>.green
  <span style="font-weight: bold;">else</span>
    puts <span style="font-style: italic;">'false'</span>.red
  <span style="font-weight: bold;">end</span>
<span style="font-weight: bold;">end</span>

assert_equal(1, 1)
</pre>
</div>
<p>
どうです．greenでしょ？
</p>

<p>
ならtestにredも付け加えて置きましょう．
</p>
<pre class="example">
assert_equal(1, 2)

</pre>
<p>
redでしょ？
</p>
</div>
</div>

<div id="outline-container-orgff2279b" class="outline-2">
<h2 id="orgff2279b"><span class="section-number-2">4</span> richer output</h2>
<div class="outline-text-2" id="text-4">
<p>
もう少し出力をrichにしましょう．
</p>
<ul class="org-ul">
<li>引数でとってきた，expected, resultの値をそのまま出力</li>
<li>どうなったかを記述
<dl class="org-dl">
<dt>true</dt><dd>print "succeeded in assert_equal.\n".green</dd>
<dt>false</dt><dd>print "failed in assert_equal.\n".red</dd>
</dl></li>
</ul>

<p>
どうです．できました？
</p>
</div>
</div>
<div id="outline-container-org16013bd" class="outline-2">
<h2 id="org16013bd"><span class="section-number-2">5</span> assert_not_equal</h2>
<div class="outline-text-2" id="text-5">
<pre class="example">
assert_not_equal(1, 2)

</pre>
<p>
を考えましょう．まずはtestです．上のんを入れて実行して見ましょう．
</p>
<pre class="example">
&gt; ruby assert_equal.rb
expected :: 1
result   :: 1
succeeded in assert_equal.
expected :: 1
result   :: 2
failed in assert_equal.
assert_equal.rb:15:in `&lt;main&gt;': undefined method `assert_not_equal' for main:Object (NoMethodError)
Did you mean?  assert_equal
</pre>
<p>
なんかが返ってくるでしょうか．関数がないと怒られます．
まずはcopy &amp; pasteします．
関数名だけassert_equalからassert_not_equalに直しましょう．
</p>
<pre class="example">
expected :: 1
result   :: 2
failed in assert_equal.
</pre>
<p>
となります．このままだと，振る舞いがおかしいですよね．
修正します．
</p>
<pre class="example">
expected :: 1
result   :: 2
succeeded in assert_not_equal.
</pre>
<p>
となればOKです．
</p>
</div>
</div>

<div id="outline-container-org18fe0dd" class="outline-2">
<h2 id="org18fe0dd"><span class="section-number-2">6</span> refactoringというほどでもないですが，</h2>
<div class="outline-text-2" id="text-6">
<p>
重複している箇所も取り除きましょう．最終的には，
</p>
<div class="org-src-container">
<pre class="src src-ruby">require <span style="font-style: italic;">'colorize'</span>
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">puts_vals</span>(expected, result)
  puts <span style="font-style: italic;">"expected :: </span><span style="font-weight: bold; font-style: italic;">#{expected}</span><span style="font-style: italic;">"</span>
  puts <span style="font-style: italic;">"result   :: </span><span style="font-weight: bold; font-style: italic;">#{result}</span><span style="font-style: italic;">"</span>
<span style="font-weight: bold;">end</span>
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">assert_not_equal</span>(expected, result)
  puts_vals(expected, result)
  <span style="font-weight: bold;">if</span> expected != result
    print <span style="font-style: italic;">"succeeded in </span><span style="font-weight: bold; font-style: italic;">#{__method__}</span><span style="font-style: italic;">.\n"</span>.green
  <span style="font-weight: bold;">else</span>
    print <span style="font-style: italic;">"failed in </span><span style="font-weight: bold; font-style: italic;">#{__method__}</span><span style="font-style: italic;">.\n"</span>.red
  <span style="font-weight: bold;">end</span>
<span style="font-weight: bold;">end</span>

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">assert_equal</span>(expected, result)
  puts_vals(expected, result)
  <span style="font-weight: bold;">case</span> expected == result
  <span style="font-weight: bold;">when</span> <span style="font-weight: bold; font-style: italic;">true</span> <span style="font-weight: bold;">then</span> print <span style="font-style: italic;">"succeeded in </span><span style="font-weight: bold; font-style: italic;">#{__method__}</span><span style="font-style: italic;">.\n"</span>.green
  <span style="font-weight: bold;">when</span> <span style="font-weight: bold; font-style: italic;">false</span> <span style="font-weight: bold;">then</span> print <span style="font-style: italic;">"failed in </span><span style="font-weight: bold; font-style: italic;">#{__method__}</span><span style="font-style: italic;">.\n"</span>.red
  <span style="font-weight: bold;">end</span>
<span style="font-weight: bold;">end</span>
</pre>
</div>
<p>
ぐらいになったでしょうか．
</p>
</div>
</div>
<div id="outline-container-org93b30f4" class="outline-2">
<h2 id="org93b30f4"><span class="section-number-2">7</span> 重複実行の予防</h2>
<div class="outline-text-2" id="text-7">
<p>
このcodeは今後繰り返し使っています．
そのためには，requireで呼び出す必要があります．
同じdirectoryに写して使うようにします．
</p>

<p>
例えば，
</p>
<div class="org-src-container">
<pre class="src src-ruby">require <span style="font-style: italic;">'./assert_equal'</span>

assert_equal(2, 1*2)
</pre>
</div>
<p>
というように使います．
</p>

<p>
しかし，今のままだとassert_equal.rbに書いたテストがそのまま実行されてしまいます．
そこで，そういうのを回避してくれるidiom(熟語)があります．
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="font-weight: bold;">if</span> <span style="font-weight: bold; font-style: italic;">$PROGRAM_NAME</span> == __FILE__
  assert_equal(1, 1)
  assert_equal(1, 2)
  assert_not_equal(1, 2)
  assert_not_equal(1, 1)
<span style="font-weight: bold;">end</span>
</pre>
</div>
<p>
です．意味は，codeが書いてあるファイル名(<span class="underline"><span class="underline">FILE</span></span>)が，
動いているファイル名($PROGRAM_NAME)と
一致したら中身を実行です．
これはidiomなんで&#x2026;覚えてください．あ，ここに書いてあるということをね．
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shigeto R. Nishitani</p>
<p class="date">Created: 2019-10-07 月 11:24</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
